{"name":"Risk Register","items":[{"type":"Heading","text":"Client Risk Assessment and Register","choices":[""]},{"type":"Paragraph","text":"Use this form to catalog risks to the organization and document any recommended remediation steps.\n \n Key Terms Defined \n• Risk is the potential impact that a threat can have on the confidentiality, integrity, and availability on NPI by exploiting a vulnerability. \n• Threats are anything that can have a negative impact on NPI. \nThreats are: \no Intentional (e.g., malicious intent); or \no Unintentional (e.g., misconfigured server, data entry error). \n\n• Threat sources are: \no Natural (e.g., floods, earthquakes, storms, tornados); \no Human (e.g., intentional such as identity thieves, hackers, spyware authors; unintentional such as data entry error, accidental deletions); or \no Environmental (e.g., power surges and spikes, hazmat contamination, environmental pollution). \n\n• Vulnerabilities are a flaw or weakness in a system security procedure, design, implementation, or control that could be intentionally or unintentionally exercised by a threat. \n• Impact is a negative quantitative and/or qualitative assessment of a vulnerability being exercised on the confidentiality, integrity, and availability of NPI. \n\nFor further information, please refer to NIST SP 800-66 and NIST SP 800-30. A link to the NIST Special Publications 800 Series is provided below:\nhttp://csrc.nist.gov/publications/PubsSPs.html","choices":[""]},{"type":"Heading","text":"Security Program","choices":[""]},{"type":"Dropdown","text":"The organization has a formally appointed central point of contact for security coordination.","choices":["Addressed"," Not Addressed"," Partially Addressed"]},{"type":"LongAnswer","text":"If so, who, and what is their position in the organization?","choices":[""]},{"type":"YesNo","text":"Does the organization work with 3rd parties, such as IT service providers, who have access to your client information?","choices":["Yes"," No"]},{"type":"YesNo","text":"Does the organization have Business Associate agreements in place with these 3rd parties?","choices":["Yes"," No"]},{"type":"LongAnswer","text":"What other controls does the organization have in place to monitor and assess 3rd parties?","choices":[""]},{"type":"Heading","text":"Security Policy","choices":[""]},{"type":"YesNo","text":"Does the organization have documented information security policies and procedures?","choices":["Yes"," No"]},{"type":"ShortAnswer","text":"Describe the organization's formal information classification procedure, if any. Example: critical, essential, and normal","choices":[""]},{"type":"LongAnswer","text":"Describe the organization's formal acceptable use rules for assets, if any. Example assets include data, computer equipment, communications equipment, etc.","choices":[""]},{"type":"LongAnswer","text":"Describe any formalized process that is in place for security policy maintenance and deviation.","choices":[""]},{"type":"Heading","text":"Risk Management and Compliance","choices":[""]},{"type":"LongAnswer","text":"Describe any formal, written process the organization uses to identify and measure potential risks.","choices":[""]},{"type":"LongAnswer","text":"Describe the process for mitigating, accepting, and transferring risk. Mitigation controls are those which reduce likelihood or severity; risk transfer includes transfer by insurance, bonds, warranties, hold harmless agreements, or other contracts; acceptance means that the organization acknowledges the documented risk and chooses to finance it internally. For accepted risk, document how it is financed.","choices":[""]},{"type":"LongAnswer","text":"Describe any formal process for identifying new laws and regulations with IT security implications.","choices":[""]},{"type":"Heading","text":"Training and Awareness","choices":[""]},{"type":"LongAnswer","text":"Describe any formal information security training provided to employees.","choices":[""]},{"type":"LongAnswer","text":"Describe how information security policies are communicated to employees.","choices":[""]},{"type":"LongAnswer","text":"Describe how periodic security reminders are delivered to employees, if at all.","choices":[""]},{"type":"Heading","text":"Personnel Security","choices":[""]},{"type":"YesNo","text":"Does the organization perform background checks to examine and assess each employee's work and criminal history?","choices":["Yes"," No"]},{"type":"YesNo","text":"Does the organization perform background checks on all contractors?","choices":["Yes"," No"]},{"type":"Dropdown","text":"Are employees required to sign a non-disclosure agreement? If so, are they required to sign it annually?","choices":["Annually"," Only Once"," Not Required"]},{"type":"Dropdown","text":"Does the organization have a formal process to manage the termination and/or transfer of employees?","choices":["Documented Formal Process"," Undocumented but Consistent Process"," No Consistent Process"]},{"type":"Heading","text":"Physical Security","choices":[""]},{"type":"Task","text":"Locks are re-keyed in the event that any key is lost, or is suspected to have been duplicated.","choices":[""]},{"type":"Task","text":"Locks securing sensitive areas are individually coded and logged so that it is known whose key/number was used to open a door.","choices":[""]},{"type":"Task","text":"A written facility security plan is in place, and known to all employees.","choices":[""]},{"type":"Task","text":"Contingency plans are in place for unusual circumstances. Example: the person with the key to the server room is sick.","choices":[""]},{"type":"Task","text":"A policy is in place to document repairs and modifications to physical components of the facility related to security.","choices":[""]},{"type":"ShortAnswer","text":"Who is responsible for ensuring that only appropriate persons have keys or codes to the facility and to locations within the facility?","choices":[""]},{"type":"LongAnswer","text":"Describe any systems that are in place to detect unauthorized entry into the facility or parts of the facility.","choices":[""]},{"type":"Heading","text":"Network Security","choices":[""]},{"type":"LongAnswer","text":"How are systems that host, transfer, or process sensitive information protected (isolated or separated) from other systems and/or networks?","choices":[""]},{"type":"Task","text":"Internal and external networks are separated by firewalls with access policies and rules.","choices":[""]},{"type":"Task","text":"A written standard approach exists to protect network devices, in order to prevent unauthorized access or network related attacks and data theft.","choices":[""]},{"type":"Task","text":"Sensitive information that is transferred in written or file form to external recipients is always encrypted, whether it is transmitted by Internet, email, or fax.","choices":[""]},{"type":"Dropdown","text":"How often does the organization perform vulnerability scans on IT systems, networks, and supporting security systems?","choices":["Infrequently or Not Performed"," Annually"," Semi-Annually or More Frequently"]},{"type":"Task","text":"3rd party connections to the network are monitored and reviewed to confirm authorized access and appropriate usage.","choices":[""]},{"type":"Heading","text":"Logical Access","choices":[""]},{"type":"Task","text":"The organization has a formal access policy based on \"least privilege\" (employees are granted the least amount of access possible to perform assigned duties) and \"need to know\" (access is granted only based on legitimate business need of the user to access the information)","choices":[""]},{"type":"LongAnswer","text":"How are systems and applications configured to restrict access only to authorized individuals?","choices":[""]},{"type":"Task","text":"A list of administrative users is maintained and available.","choices":[""]},{"type":"Task","text":"A list of acceptable mobile devices on the network exists, based on testing.","choices":[""]},{"type":"Task","text":"Sensitive information (example: social security numbers) is removed from, or encrypted within, documents and/or websites before it is distributed.","choices":[""]},{"type":"Task","text":"Software installation is restricted by policy for desktops and laptops.","choices":[""]},{"type":"Task","text":"Software installation on servers undergoes formal review and testing before being made live on the network.","choices":[""]},{"type":"Task","text":"Access to source code, if any, is restricted using two factor authentication. A list of authorized users is maintained and available.","choices":[""]},{"type":"Task","text":"User IDs for IT systems are uniquely identifiable and allow an admin to quickly determine which users they belong to.","choices":[""]},{"type":"Task","text":"A process is in place to review user accounts and related access.","choices":[""]},{"type":"Heading","text":"Operations Management","choices":[""]},{"type":"YesNo","text":"Antivirus software has been deployed and installed on all computers and supporting systems,","choices":["Yes"," No"]},{"type":"ShortAnswer","text":"Describe any antivirus software or services that are provided.","choices":[""]},{"type":"ShortAnswer","text":"Describe how systems and networks are monitored for security events, if at all.","choices":[""]},{"type":"YesNo","text":"Are laptops, hard drives, external drives, and backup tapes encrypted?","choices":["Yes"," No"]},{"type":"LongAnswer","text":"What procedures are in place to protect documents, computer media (e.g.: tapes, disks, CD-ROMs, etc.) from unauthorized disclosure, modification, removal, and destruction?","choices":[""]},{"type":"YesNo","text":"Does all IT equipment, including printers, fax machines, phones, hard disks, and computers undergo a secure disposal process when disposed of?","choices":["Yes"," No"]},{"type":"YesNo","text":"Are development and test environments separated from production applications to protect against inadvertent changes or disruption?","choices":["Yes"," No"]},{"type":"YesNo","text":"Are duties separated to reduce the opportunity for unauthorized modification, unintentional modification or misuse of the organization's IT resources?","choices":["Yes"," No"]},{"type":"LongAnswer","text":"Describe any separation of duties in regards to IT resources.","choices":[""]},{"type":"YesNo","text":"Is a formal, written change management procedure followed for networks, systems, desktops, software releases, deployments, and patches?","choices":["Yes"," No"]},{"type":"YesNo","text":"During the investigation of a security incident, is evidence collected and maintained according to a formal, written security response plan?","choices":["Yes"," No"]},{"type":"YesNo","text":"Are all incidents identified, investigated, and reported according to applicable legal requirements?","choices":["Yes"," No"]},{"type":"LongAnswer","text":"How are incidents escalated and communicated?","choices":[""]},{"type":"YesNo","text":"Is all critical data backed up?","choices":["Yes"," No"]},{"type":"LongAnswer","text":"How is data backed up, if at all?","choices":[""]},{"type":"Dropdown","text":"How frequently are backups tested to ensure that they can be restored?","choices":["Daily"," Weekly"," Monthly"," Quarterly"," Annually"," Not Tested"]},{"type":"Dropdown","text":"How often are disaster recovery plans updated?","choices":["Monthly"," Quarterly"," Yearly"," Infrequently"," Never"]},{"type":"YesNo","text":"Does a written disaster recovery plan exist for the organization, and does it consider interruption tom or failure of, critical IT systems? Would the plan be usable by employees in the event of a disaster, system or power failure?","choices":["Yes"," No"]}]}