{"name":"HIPAA: NIST 800-66: 4.10: Facility Access Controls","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Conduct an Analysis of Existing Physical Security Vulnerabilities","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Inventory facilities and identify shortfalls and/or vulnerabilities in current physical security capabilities.</li>\n<li>Assign degrees of significance to each vulnerability identified and ensure that proper access is allowed.</li>\n<li>Determine which types of facilities require access controls to safeguard EPHI, such as:\n<ul>\n<li>Data Centers</li>\n<li>Peripheral equipment locations</li>\n<li>IT staff offices</li>\n<li>Workstation locations.</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"If reasonable and appropriate, do nonpublic areas have locks and cameras?","choices":[]},{"type":"YesNo","text":"Are workstations protected from public access or viewing?","choices":[]},{"type":"YesNo","text":"Are entrances and exits that lead to locations with EPHI secured?","choices":[]},{"type":"YesNo","text":"Do policies and procedures already exist regarding access to and use of facilities and equipment?","choices":[]},{"type":"YesNo","text":"Are there possible natural or man-made disasters that could happen in our environment?","choices":[]},{"type":"YesNo","text":"Do normal physical protections exist (locks on doors, windows, etc., and other means of preventing unauthorized access)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Identify Corrective Measures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify and assign responsibility for the measures and activities necessary to correct deficiencies and ensure that proper access is allowed.</li>\n<li>Develop and deploy policies and procedures to ensure that repairs, upgrades, and /or modifications are made to the appropriate physical areas of the facility while ensuring that proper access is allowed.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Who is responsible for security?","choices":[]},{"type":"LongAnswer","text":"Is a workforce member other than the security official responsible for facility/physical security?","choices":[]},{"type":"LongAnswer","text":"Are facility access control policies and procedures already in place? Do they need to be revised?","choices":[]},{"type":"LongAnswer","text":"What training will be needed for employees to understand the policies and procedures?","choices":[]},{"type":"LongAnswer","text":"How will we document the decisions and actions?","choices":[]},{"type":"LongAnswer","text":"Are we dependent on a landlord to make physical changes to meet the requirements?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Develop a Facility Security Plan","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement policies and procedures to safeguard the facility and the equipment therein from unauthorized physical access, tampering, and theft.</li>\n<li>Implement appropriate measures to provide physical security protection for EPHI in a covered entity&rsquo;s possession.</li>\n<li>Include documentation of the facility inventory, as well as information regarding the physical maintenance records and the history of changes, upgrades, and other modifications.</li>\n<li>Identify points of access to the facility and existing security controls.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there an inventory of facilities and existing security practices?","choices":[]},{"type":"LongAnswer","text":"What are the current procedures for securing the facilities (exterior, interior, equipment, access controls, maintenance records, etc.)?","choices":[]},{"type":"YesNo","text":"Is a workforce member other than the security official responsible for the facility plan?","choices":[]},{"type":"MultiChecklist","text":"Is there a contingency plan?","choices":["Already in place","Under revision","Under development"]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Develop Access Control and Validation Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures to control and validate a person's access to facilities based on their role or function, including visitor control, and control of access to software programs for testing and revision.</li>\n<li>Implement procedures to provide facility access to authorized personnel and visitors, and exclude unauthorized persons.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What are the policies and procedures in place for controlling access by staff, contractors, visitors, and probationary employees?","choices":[]},{"type":"LongAnswer","text":"How many access points exist in each facility? Is there an inventory?","choices":[]},{"type":"YesNo","text":"Is monitoring equipment necessary?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Establish Contingency Operations Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish (and implement as needed) procedures that allow facility access in support of restoration of lost data under the Disaster Recovery Plan and Emergency Mode Operations Plan in the event of an emergency.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Who needs access to EPHI in the event of a disaster?","choices":[]},{"type":"ShortAnswer","text":"What is the backup plan for access to the facility and/or EPHI?","choices":[]},{"type":"ShortAnswer","text":"Who is responsible for the contingency plan for access to EPHI?","choices":[]},{"type":"LongAnswer","text":"Who is responsible for implementing the contingency plan for access to EPHI in each department, unit, etc.?","choices":[]},{"type":"LongAnswer","text":"Will the contingency plan be appropriate in the event of all types of potential disasters (fire, flood, earthquake, etc.)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Maintain Maintenance Records","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement policies and procedures to document repairs and modifications to the physical components of a facility which are related to security (for example, hardware, walls, doors and locks).</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are records of repairs to hardware, walls, doors, and locks maintained?","choices":[]},{"type":"ShortAnswer","text":"Has responsibility for maintaining these records been assigned?","choices":[]}]}