{"name":"HIPAA: NIST 800-66: 4.19: Business Associate Contracts or Other Arrangements","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Contract Must Provide that Business Associates Adequately Protect EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Contracts between covered entities and business associates must provide that business associates will implement administrative, physical, and technical safeguards that reasonably and appropriately protect the confidentiality, integrity, and availability of the EPHI that the business associate creates, receives, maintains, or transmits on behalf of the covered entity.</li>\n<li>May consider asking the business associate to conduct a risk assessment that addresses administrative, technical, and physical risks, if reasonable and appropriate.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Does the written agreement between the covered entity and the business associate address the applicable functions related to creating, receiving, maintaining, and transmitting EPHI that the business associate is to perform on behalf of the covered entity?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Contract Must Provide that Business Associate’s Agents Adequately Protect EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Contracts between covered entities and business associates must provide that any agent, including a subcontractor, to whom the business associate provides such information agrees to implement reasonable and appropriate safeguards to protect it;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Does the written agreement address the issue of EPHI access by subcontractors and other agents of the business associate?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Contract Must Provide that Business Associates will Report Security Incidents","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Contracts between covered entities and business associates must provide that business associates will report to the covered entity any security incident of which it becomes aware.</li>\n<li>Establish a reporting mechanism and a process for the business associate to use in the event of a security incident.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there a procedure in place for reporting of incidents by business associates?","choices":[]},{"type":"YesNo","text":"Have key business associate staff that would be the point of contact in the event of a security incident been identified?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Contract Must Provide that Business Associate Will Authorize Termination of the Contract if it has been Materially Breached","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Contracts between covered entities and business associates must provide that the business associate will authorize termination of the contract by the covered entity if the covered entity determines that the business associate has violated a material term of the contract.</li>\n<li>Establish in the written agreement with business associates the circumstances under which a violation of agreements relating to the security of EPHI constitutes a material breach of the contract.</li>\n<li>Terminate the contract if:\n<ul>\n<li>the covered entity learns that the business associate has violated the contract or materially breached it, and</li>\n<li>It is not possible to take reasonable steps to cure the breach or end the violation, as applicable.</li>\n</ul>\n</li>\n<li>If terminating the contract is not feasible, report the problem to the Secretary of HHS.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have standards and thresholds for termination of the contract been included in the contract?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Government Entities May Satisfy Business Associate Contract Requirements through Other Arrangements","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>If the covered entity and business associate are both governmental entities, consult &sect; 164.314 (a)(2)(ii) of the Security Rule.</li>\n<li>If both entities are governmental entities, the covered entity is in compliance with &sect; 164.314 (a)(1) if:\n<ul>\n<li>It executes a Memorandum of Understanding (MOU) with the business associate that contains terms that accomplish the objectives of &sect; 164.314(a)(2)(i), or</li>\n<li>Other law (including regulations adopted by the covered entity or its business associate) contains requirements applicable to the business associate that accomplish the objectives of &sect; 164.314(a)(2)(i).</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do the arrangements provide protections for EPHI equivalent to those provided by the organization’s business associate contracts?","choices":[]},{"type":"YesNo","text":"If termination of the MOU is not possible due to the nature of the relationship between the covered entity and the business associate, are other mechanisms for enforcement available, reasonable, and appropriate?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Other Arrangements for Covered Entities and Business Associates.","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>If a business associate is required by law to perform a function or activity on behalf of a covered entity or to provide a service described in the definition of business associate as specified in &sect;160.103 to a covered entity, the covered entity may permit the business associate to create, receive, maintain, or transmit electronic protected health information on its behalf to the extent necessary to comply with the legal mandate without meeting the requirements of &sect; 164.314(a)(2)(i), provided that the covered entity attempts in good faith to obtain satisfactory assurances as required by &sect; 164.314(a)(2)(ii)(A), and documents the attempt and the reasons that these assurances cannot be obtained.</li>\n<li>The covered entity may omit from its other arrangements authorization of the termination of the contract by the covered entity, as required by &sect; 164.314(a)(2)(i)(D), if such authorization is inconsistent with the statutory obligations of the covered entity or its business associate.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Has the covered entity made a good faith attempt to obtain satisfactory assurances that the security standards required by this section are met?","choices":[]},{"type":"YesNo","text":"Are attempts to obtain satisfactory assurances and the reasons assurances cannot be obtained documented?","choices":[]},{"type":"YesNo","text":"Does the covered entity or its business associate have statutory obligations which require removal of the authorization of termination requirement?","choices":[]}]}