{"name":"HIPAA: NIST 800-66: 4.6: Security Incident Procedures","items":[{"type":"Heading","text":"1) Determine Goals of Incident Response","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Gain an understanding as to what constitutes a true security incident. Under the HIPAA Security Rule, a security incident is the attempted or successful unauthorized access, use, disclosure, modification, or destruction of information or interference with system operations in an information system. (45 CFR &sect; 164.304)</li>\n<li>Determine how the organization will respond to a security incident.</li>\n<li>Establish a reporting mechanism and a process to coordinate responses to the security incident.</li>\n<li>Provide direct technical assistance, advise vendors to address product-related problems, and provide liaisons to legal and criminal investigative groups as needed.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Has the HIPAA-required security risk assessment resulted in a list of potential physical or technological events that could result in a breach of security?","choices":[]},{"type":"YesNo","text":"Is there a procedure in place for reporting and handling incidents?","choices":[]},{"type":"YesNo","text":"Has an analysis been conducted that relates reasonably anticipated threats and hazards to the organization that could result in a security incident to the methods that would be used for mitigation?","choices":[]},{"type":"YesNo","text":"Have the key functions of the organization been prioritized to determine what would need to be restored first in the event of a disruption?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Develop and Deploy an Incident Response Team or Other Reasonable and Appropriate Response Mechanism","choices":[]},{"type":"Paragraph","text":"<p>Determine if the size, scope, mission, and other aspects of the organization justify the reasonableness and appropriateness of maintaining a standing incident response team.</p>\n<p>Identify appropriate individuals to be a part of a formal incident response team, if the organization has determined that implementing an incident response team is reasonable and appropriate.</p>","choices":[]},{"type":"YesNo","text":"Do members of the team have adequate knowledge of the organization’s hardware and software?","choices":[]},{"type":"YesNo","text":"Do members of the team have the authority to speak for the organization to the media, law enforcement, and clients or business partners?","choices":[]},{"type":"YesNo","text":"Has the incident response team received appropriate training in incident response activities?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Develop and Implement Procedures to Respond to and Report Security Incidents","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify and respond to suspected or known security incidents; mitigate, to the extent practicable, harmful effects of security incidents that are known to the covered entity; and document security incidents and their outcomes.</li>\n<li>Document incident response procedures that can provide a single point of reference to guide the day-to-day operations of the incident response team.</li>\n<li>Review incident response procedures with staff with roles and responsibilities related to incident response, solicit suggestions for improvements, and make changes to reflect input if reasonable and appropriate.</li>\n<li>Update the procedures as required based on changing organizational needs.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Has the organization determined that maintaining a staffed security incident hotline would be reasonable and appropriate?","choices":[]},{"type":"LongAnswer","text":"Has the organization determined reasonable and appropriate mitigation options for security incidents?","choices":[]},{"type":"LongAnswer","text":"Has the organization determined that standard incident report templates to ensure that all necessary information related to the incident is documented and investigated are reasonable and appropriate?","choices":[]},{"type":"LongAnswer","text":"Has the organization determined under what conditions information related to a security breach will be disclosed to the media?","choices":[]},{"type":"LongAnswer","text":"Have appropriate (internal and external) persons who should be informed of a security breach been identified and a contact information list prepared?","choices":[]},{"type":"LongAnswer","text":"Has a written incident response plan been developed and provided to the incident response team?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Incorporate Post-Incident Analysis into Updates and Revisions","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Measure effectiveness and update security incident response procedures to reflect lessons learned, and identify actions to take that will improve security controls after a security incident.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Does the incident response team keep adequate documentation of security incidents and their outcomes, which may include what weaknesses were exploited and how access to information was gained?","choices":[]},{"type":"LongAnswer","text":"Do records reflect new contacts and resources identified for responding to an incident?","choices":[]},{"type":"LongAnswer","text":"Does the organization consider whether current procedures were adequate for responding to a particular security incident?","choices":[]}]}