{"name":"HIPAA: NIST 800-66: 4.7: Contingency Plan","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Develop Contingency Planning Policy","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Define the organization&rsquo;s overall contingency objectives.</li>\n<li>Establish the organizational framework, roles, and responsibilities for this area.</li>\n<li>Address scope, resource requirements, training, testing, plan maintenance, and backup requirements.</li>\n<li>A contingency planning methodology, based on NIST SP 800-34, is included in Appendix F of this document.</li>\n</ul>","choices":[]},{"type":"MultiChecklist","text":"What critical services must be provided within specified timeframes?","choices":["Patient treatment, for example, may need to be performed without disruption.","By contrast, claims processing may be delayed during an emergency with no long-term damage to the organization."]},{"type":"LongAnswer","text":"Have cross-functional dependencies been identified so as to determine how the failure in one system may negatively impact another one?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Conduct an Applications and Data Criticality Analysis","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Assess the relative criticality of specific applications and data in support of other Contingency Plan components.</li>\n<li>Identify the activities and material involving EPHI that are critical to business operations.</li>\n<li>Identify the critical services or operations, and the manual and automated processes that support them, involving EPHI.</li>\n<li>Determine the amount of time the organization can tolerate disruptions to these operations, material, or services (e.g., due to power outages).</li>\n<li>Establish cost-effective strategies for recovering these critical services or processes.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What hardware, software, and personnel are critical to daily operations?","choices":[]},{"type":"LongAnswer","text":"What is the impact on desired service levels if these critical assets are not available?","choices":[]},{"type":"LongAnswer","text":"What, if any, support is provided by external providers (Internet service providers [ISPs], utilities, or contractors)?","choices":[]},{"type":"LongAnswer","text":"What is the nature and degree of impact on the operation if any of the critical resources are not available?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Identify Preventive Measures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify preventive measures for each defined scenario that could result in loss of a critical service operation involving the use of EPHI.</li>\n<li>Ensure that identified preventive measures are practical and feasible in terms of their applicability in a given environment.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What alternatives for continuing operations of the organization are available in case of loss of any critical function/resource?","choices":[]},{"type":"LongAnswer","text":"What is the cost associated with the preventive measures that may be considered?","choices":[]},{"type":"LongAnswer","text":"Are the preventive measures feasible (affordable and practical for the environment)?","choices":[]},{"type":"LongAnswer","text":"What plans, procedures, or agreements need to be initiated to enable implementation of the preventive measures, if they are necessary?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Develop Recovery Strategy","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Finalize the set of contingency procedures that should be invoked for all identified impacts, including emergency mode operation. The strategy must be adaptable to the existing operating environment and address allowable outage times and associated priorities identified in step 2.</li>\n<li>Ensure, if part of the strategy depends on external organizations for support, that formal agreements are in place with specific requirements stated.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have procedures related to recovery from emergency or disastrous events been documented?","choices":[]},{"type":"YesNo","text":"Has a coordinator who manages, maintains, and updates the plan been designated?","choices":[]},{"type":"YesNo","text":"Has an emergency call list been distributed to all employees?","choices":[]},{"type":"YesNo","text":"Have recovery procedures been documented?","choices":[]},{"type":"LongAnswer","text":"Has a determination been made regarding when the plan needs to be activated (anticipated duration of outage, tolerances for outage or loss of capability, impact on service delivery, etc.)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Data Backup Plan and Disaster Recovery Plan","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish and implement procedures to create and maintain retrievable exact copies of EPHI.</li>\n<li>Establish (and implement as needed) procedures to restore any loss of data.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there a formal, written contingency plan?","choices":[]},{"type":"YesNo","text":"Does it address disaster recovery and data backup?","choices":[]},{"type":"YesNo","text":"Do data backup procedures exist?","choices":[]},{"type":"YesNo","text":"Are responsibilities assigned to conduct backup activities?","choices":[]},{"type":"LongAnswer","text":"Are data backup procedures documented and available to other staff?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Develop and Implement an Emergency Mode Operation Plan","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish (and implement as needed) procedures to enable continuation of critical business processes for protection of the security of EPHI while operating in emergency mode.</li>\n<li>&ldquo;Emergency mode&rdquo; operation involves only those critical business processes that must occur to protect the security of EPHI during and immediately after a crisis situation.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have procedures been developed to continue the critical functions identified in Key Activity?","choices":[]},{"type":"YesNo","text":"If so, have those critical functions that also involve the use of EPHI been identified?","choices":[]},{"type":"LongAnswer","text":"Would different staff, facilities, or systems be needed to perform those functions?","choices":[]},{"type":"LongAnswer","text":"Has the security of that EPHI in that alternative mode of operation been assured?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"7) Testing and Revision Procedure","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures for periodic testing and revision of contingency plans.</li>\n<li>Test the contingency plan on a predefined cycle (stated in the policy developed under Key Activity), if reasonable and appropriate.</li>\n<li>Train those with defined plan responsibilities on their roles.</li>\n<li>If possible, involve external entities (vendors, alternative site/service providers) in testing exercises.</li>\n<li>Make key decisions regarding how the testing is to occur (&ldquo;tabletop&rdquo; exercise versus staging a real operational scenario including actual loss of capability).</li>\n<li>Decide how to segment the type of testing based on the assessment of business impact and acceptability of sustained loss of service. Consider cost.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"How is the plan to be tested?","choices":[]},{"type":"LongAnswer","text":"Does testing lend itself to a phased approach?","choices":[]},{"type":"LongAnswer","text":"Is it feasible to actually take down functions/services for the purposes of testing?","choices":[]},{"type":"LongAnswer","text":"Can testing be done during normal business hours or must it take place during off hours?","choices":[]},{"type":"LongAnswer","text":"If full testing is infeasible, has a “tabletop” scenario (e.g., a classroom-like exercise) been considered?","choices":[]},{"type":"ShortAnswer","text":"How frequently is the plan to be tested (e.g., annually)?","choices":[]},{"type":"ShortAnswer","text":"When should the plan be revised?","choices":[]}]}