{"name":"HIPAA: NIST 800-66: 4.21: Policies and Procedures","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Create and Deploy Policies and Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement reasonable and appropriate policies and procedures to comply with the standards, implementation specifications, and other requirements of the HIPAA Security Rule.</li>\n<li>Periodically evaluate written policies and procedures to verify that:116\n<ul>\n<li>Policies and procedures are sufficient to address the standards, implementation specifications, and other requirements of the HIPAA Security Rule.</li>\n<li>Policies and procedures accurately reflect the actual activities and practices exhibited by the covered entity, its staff, its systems, and its business associates.</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are reasonable and appropriate policies and procedures to comply with the standards, implementation specifications, and other requirements of the HIPAA Security Rule in place?","choices":[]},{"type":"MultiChecklist","text":"Are policies and procedures reasonable and appropriate given:","choices":["the size, complexity, and capabilities of the covered entity;","the covered entity’s technical infrastructure, hardware, and software security capabilities;","the costs for security measures; and","the probability and criticality of potential risks to EPHI",""]},{"type":"LongAnswer","text":"Do procedures exist for periodically reevaluating the policies and procedures, updating them as necessary?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Update Documentation of Policy and Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Change policies and procedures as is reasonable and appropriate, at any time, provided that the changes are documented and implemented in accordance with the requirements of the HIPAA Security Rule.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Should HIPAA documentation be updated in response to periodic evaluations, following security incidents, and/or after acquisitions of new technology or new procedures? As policies and procedures are changed, are new versions made available and are workforce members appropriately trained?","choices":[]}]}