{"name":"HIPAA: NIST 800-66: 4.11: Workstation Use","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Identify Workstation Types and Functions or Uses","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Inventory workstations and devices.</li>\n<li>Develop policies and procedures for each type of workstation and workstation device, identifying and accommodating their unique issues.</li>\n<li>Classify workstations based on the capabilities, connections, and allowable activities for each workstation used.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do we have an inventory of workstation types and locations in my organization?","choices":[]},{"type":"ShortAnswer","text":"Who is responsible for this inventory and its maintenance?","choices":[]},{"type":"LongAnswer","text":"What tasks are commonly performed on a given workstation or type of workstation?","choices":[]},{"type":"YesNo","text":"Are all types of computing devices used as workstations identified along with the use of these workstations?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Identify Expected Performance of Each Type of Workstation","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Develop and document policies and procedures related to the proper use and performance of workstations.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"How are workstations used in day-to-day operations?","choices":[]},{"type":"LongAnswer","text":"What are key operational risks that could result in a breach of security?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Analyze Physical Surroundings for Physical Attributes","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Ensure that any risks associated with a workstation&rsquo;s surroundings are known and analyzed for possible negative impacts.</li>\n<li>Develop policies and procedures that will prevent or preclude unauthorized access of unattended workstations, limit the ability of unauthorized persons to view sensitive information, and dispose of sensitive information as needed.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Where are workstations located?","choices":[]},{"type":"YesNo","text":"Is viewing by unauthorized individuals restricted or limited at these workstations?","choices":[]},{"type":"YesNo","text":"Do changes need to be made in the space configuration?","choices":[]},{"type":"YesNo","text":"Do employees understand the security requirements for the data they use in their day-to-day jobs?","choices":[]}]}