{"name":"HIPAA: NIST 800-66: 4.3: Workforce Security","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Implement Procedures for Authorization and/or Supervision","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures for the authorization and/or supervision of workforce members who work with EPHI or in locations where it might be accessed.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have chains of command and lines of authority been established? ","choices":[]},{"type":"YesNo","text":"Have staff members been made aware of the identity and roles of their supervisors?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Establish Clear Job Descriptions and Responsibilities","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Define roles and responsibilities for all job functions.</li>\n<li>Assign appropriate levels of security oversight, training, and access.</li>\n<li>Identify in writing who has the business need&mdash;and who has been granted permission&mdash;to view, alter, retrieve, and store EPHI, and at what times, under what circumstances, and for what purposes.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are there written job descriptions that are correlated with appropriate levels of access? ","choices":[]},{"type":"YesNo","text":"Have staff members been provided copies of their job descriptions, informed of the access granted to them, as well as the conditions by which this access can be used?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Establish Criteria and Procedures for Hiring and Assigning Tasks","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Ensure that staff members have the necessary knowledge, skills, and abilities to fulfill particular roles, e.g., positions involving access to and use of sensitive information.&nbsp;</li>\n<li>Ensure that these requirements are included as part of the personnel hiring process.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have the qualifications of candidates for specific positions been checked against the job description?","choices":[]},{"type":"YesNo","text":"Have determinations been made that candidates for specific positions are able to perform the tasks of those positions?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Establish a Workforce Clearance Procedure","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures to determine that the access of a workforce member to EPHI is appropriate.</li>\n<li>Implement appropriate screening of persons who will have access to EPHI.</li>\n<li>Implement a procedure for obtaining clearance from appropriate offices or individuals where access is provided or terminated.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there an implementation strategy that supports the designated access authorities?","choices":[]},{"type":"YesNo","text":"Are applicants’ employment and educational references checked, if reasonable and appropriate?","choices":[]},{"type":"YesNo","text":"Have background checks been completed, if reasonable and appropriate?","choices":[]},{"type":"YesNo","text":"Do procedures exist for obtaining appropriate sign-offs to grant or terminate access to EPHI?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Establish Termination Procedures ","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures for terminating access to EPHI when the employment of a workforce member ends or as required by determinations made as specified in &sect;164.308(a)(3)(ii)(B).</li>\n<li>Develop a standard set of procedures that should be followed to recover access control devices (Identification [ID] badges, keys, access cards, etc.) when employment ends.</li>\n<li>Deactivate computer access accounts (e.g., disable user IDs and passwords). See the Access Controls Standard.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are there separate procedures for voluntary termination (retirement, promotion, transfer, change of employment) vs. involuntary termination (termination for cause, reduction in force, involuntary transfer, and criminal or disciplinary actions), if reasonable and appropriate?","choices":[]},{"type":"YesNo","text":"Is there a standard checklist for all action items that should be completed when an employee leaves (return of all access devices, deactivation of logon accounts [including remote access], and delivery of any needed data solely under the employee’s control)?","choices":[]}]}