{"name":"HIPAA: NIST 800-66: 4.9: Business Associate Contracts and Other Arrangements","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Identify Entities that Are Business Associates under the HIPAA Security Rule","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify the individual or department who will be responsible for coordinating the execution of business associate agreements or other arrangements.</li>\n<li>Reevaluate the list of business associates to determine who has access to EPHI in order to assess whether the list is complete and current.</li>\n<li>Identify systems covered by the contract/agreement.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Do the business associate agreements written and executed contain sufficient language to ensure that required information types will be protected?","choices":[]},{"type":"MultiChecklist","text":"Are there any new organizations or vendors that now provide a service or function on behalf of the organization? Such services may include the following:","choices":["Claims processing or billing","Data analysis","Utilization review","Quality assurance","Benefit management","Practice management","Re-pricing","Hardware maintenance","All other HIPAA-regulated functions"]},{"type":"MultiChecklist","text":"Have outsourced functions involving the use of EPHI been considered, such as the following:","choices":["Data aggregation","Administrative services","Accreditation","Financial services"]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Written Contract or Other Arrangement","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Document the satisfactory assurances required by this standard through a written contract or other arrangement with the business associate that meets the applicable requirements of &sect;164.314(a).58</li>\n<li>Execute new or update existing agreements or arrangements as appropriate.</li>\n<li>Identify roles and responsibilities.</li>\n<li>Include security requirements in business associate contracts/agreements to address confidentiality, integrity, and availability of EPHI.</li>\n<li>Specify any training requirements associated with the contract/agreement or arrangement, if reasonable and appropriate.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Who is responsible for coordinating and preparing the final agreement or arrangement?","choices":[]},{"type":"YesNo","text":"Does the agreement or arrangement specify how information is to be transmitted to and from the business associate?","choices":[]},{"type":"YesNo","text":"Have security controls been specified for the business associate?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Establish Process for Measuring Contract Performance and Terminating the Contract if Security Requirements Are Not Being Met","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Maintain clear lines of communication.</li>\n<li>Conduct periodic security reviews.</li>\n<li>Establish criteria for measuring contract performance.</li>\n<li>If the business associate is a governmental entity, update the memorandum of understanding or other arrangement when required by law or regulation or when reasonable and appropriate.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What is the service being performed?","choices":[]},{"type":"LongAnswer","text":"What is the outcome expected?","choices":[]},{"type":"YesNo","text":"Is there a process for reporting security incidents related to the agreement?","choices":[]},{"type":"YesNo","text":"Is there a process in place to periodically evaluate the effectiveness of business associate security controls?","choices":[]},{"type":"LongAnswer","text":"Is there a process in place for terminating the contract if requirements are not being met and has the business associate been advised what conditions would warrant termination?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Implement An Arrangement Other than a Business Associate Contract if Reasonable and Appropriate","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>If the covered entity and its business associate are both governmental entities, use a memorandum of understanding or reliance on law or regulation that requires equivalent actions on the part of the business associate.</li>\n<li>Document the law, regulation, memorandum, or other document that assures that the governmental entity business associate will implement all required safeguards for EPHI involved in transactions between the parties.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Is the covered entity’s business associate a federal, state, or local governmental entity?","choices":[]},{"type":"YesNo","text":"Is there a usual procedure for creating memoranda of understanding between the parties?","choices":[]},{"type":"LongAnswer","text":"Has the covered entity researched and reviewed all law and regulation governing the use of EPHI by the governmental entity business associate?","choices":[]}]}