{"name":"HIPAA: NIST 800-66: 4.2 Assigned Security Responsibility","instructions":"<p>HIPAA Standard: Identify the security official who is responsible for the development and implementation of the policies and procedures required by this subpart for the entity.</p>","items":[{"type":"Heading","text":"1) Select a Security Official To Be Assigned Responsibility for HIPAA Security","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify the individual who has final responsibility for security.</li>\n<li>Select an individual who is able to assess effective security and to serve as the point of contact for security policy, implementation, and monitoring.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Who in the organization oversees the development and communication of security policies and procedures?","choices":[]},{"type":"ShortAnswer","text":"Who in the organization is responsible for conducting the risk assessment?","choices":[]},{"type":"ShortAnswer","text":"Who in the organization handles the results of periodic security evaluations and continuous monitoring?","choices":[]},{"type":"ShortAnswer","text":"Who in the organization directs IT security purchasing and investment?","choices":[]},{"type":"ShortAnswer","text":"Who in the organization ensures that security concerns have been","choices":[]},{"type":"ShortAnswer","text":"Who in the organization is authorized to accept risk from information systems on behalf of the organization?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Assign and Document the Individual’s Responsibility","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Document the assignment to one individual&rsquo;s responsibilities in a job description.</li>\n<li>Communicate this assigned role to the entire organization.</li>\n</ul>","choices":[]},{"type":"Task","text":"Is there a complete job description that accurately reflects assigned security duties and responsibilities?","choices":[]},{"type":"Task","text":"Have the staff members in the organization been notified as to whom to call in the event of a security problem?","choices":[]}]}