{"name":"HIPAA: Breach Notification Procedure","instructions":"<p>from <a href=\"https://www.hhs.gov/hipaa/for-professionals/breach-notification/index.html\" target=\"_blank\" rel=\"noopener\">HHS.gov/Breach-Notification</a></p>","items":[{"type":"ShortAnswer","text":"Incident name","choices":[]},{"type":"ShortAnswer","text":"Incident Date","choices":[]},{"type":"LongAnswer","text":"Describe the incident","choices":[]},{"type":"FileUpload","text":"Supporting documents","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Paragraph","text":"<p>A breach is, generally, an impermissible use or disclosure under the Privacy Rule that compromises the security or privacy of the protected health information.</p>","choices":[]},{"type":"YesNo","text":"By this definition, did a breach occur?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"Is notification and reporting required?","choices":[]},{"type":"YesNo","text":"If you checked Yes, is there a low probablility that the protected health information has been compromised based on a risk assessment of at least the following factors.  If the probability is low, stop. You don't need to report the incident.","choices":[]},{"type":"Task","text":"The nature and extent of the protected health information involved, including the types of identifiers and the likelihood of re-identification;","choices":[]},{"type":"Task","text":"The unauthorized person who used the protected health information or to whom the disclosure was made;","choices":[]},{"type":"Task","text":"Whether the protected health information was actually acquired or viewed; and","choices":[]},{"type":"Task","text":"The extent to which the risk to the protected health information has been mitigated.","choices":[]},{"type":"LongAnswer","text":"Explain detailed rationale behind above answer","choices":[]},{"type":"MultiChecklist","text":"Additionally, if any of the following apply, you do not need to report the breach: ","choices":["Does the following exemption apply: Was the unintentional acquisition, access, or use of protected health information by a workforce member or person acting under the authority of a covered entity or business associate, made in good faith and within the scope of authority?","Does the following exemption apply: Was the protected health information inadvertently disclosed by a person authorized to access protected health information at a covered entity or business associate to another person authorized to access protected health information at the covered entity or business associate, or organized health care arrangement in which the covered entity participates.  Note that the information cannot be further used or disclosed in a manner not permitted by the Privacy Rule.","Does the following exemption apply: Does the covered entity or business associate have a good faith belief that the unauthorized person to whom the impermissible disclosure was made will not be able to retain the information."]},{"type":"MultiChecklist","text":"Finally, if the following applies, you do not need to report the breach: ","choices":["The information was released in a format that that renders it unusable, unreadable or indeciperable.  (View specific methodologies here: https://www.hhs.gov/hipaa/for-professionals/breach-notification/guidance/index.html) "]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"Breach reporting and notifications (if required by previous section)","choices":[]},{"type":"ShortAnswer","text":"Decide whether the covered entity or the business associate should perform the notifications.  Consider who has the relationship with the individual(s) in question, which entity is in the best position to provide notice, and the functions of each party.  Enter name and type of entity that will perform the notifications and reporting:","choices":[]},{"type":"MultiChecklist","text":"Within 60 days of breach discovery: ","choices":["Notify each individual without unreasonable delay whose protected health information was compromized via first class mail, or, alternatively, by email if the affected individual has agreed to receive such notices electronically.  ","Include a brief description of the breach","Include a description of the types of information involved in the breach","Include the steps affected individuals should take to protect themselves from potential harm","Include a brief description of what the covered entity is doing to investigate the breach, mitigate the harm, and prevent further breaches","Include contact information for the covered entity or business associate, as appropriate"]},{"type":"MultiChecklist","text":"If 10 or more of the individuals whose information was breached have invalid contact information, provide substitute notice using one of the following options: ","choices":["Post a notice on the home page of the notifying entity's web site for at least 90 days.  Include a toll free phone number that remains active during that time where individuals can learn if their information was involved in the breach.  ","OR Post a notice in a major print or broadcast media outlet where the individuals likely reside.   Include a toll free phone number that remains active for at least 90 days where individuals can learn if their information was involved in the breach.  ",""]},{"type":"MultiChecklist","text":"If fewer than 10 of the individuals whose information was breached have invalid contact information, do the following","choices":["Provide substitute notice by an alternative form of written notice","OR by telephone","OR by other means"]},{"type":"MultiChecklist","text":"Notification of the Secretary of HHS","choices":["If the breach involved 500 or more individuals, notify the Secretary without unreasonable delay and within 60 days of the breach by visiting the HHS website and filling out and electronically submitting a breach report form. ","If the breach involves fewer than 500 individuals, notify the Secretary of such breaches on an annual basis no later than 60 days after the end of the calendar year in which the breaches are discovered.  "]},{"type":"SectionBreak","choices":[]},{"type":"MultiChecklist","text":"  If the breach affects 500 individuals or more in a state or jurisdiction, in addition to the tasks in the section above, do the following within 60 days of breach discovery for each jurisdiction: ","choices":["Notify prominent media outlets serving the state or jurisdiction.  This notification can be done via press release to these outlets.  ","Include the same information required for the individual notice"]}]}