{"name":"HIPAA: Risk Assessment","instructions":"<p>from: <a href=\"https://www.hhs.gov/sites/default/files/ocr/privacy/hipaa/administrative/securityrule/rafinalguidancepdf.pdf\" target=\"_blank\" rel=\"noopener\">HHS.gov</a></p>","items":[{"type":"LongAnswer","text":"Identify all electronic personal health information in your organization and list it here.  Consider e-PHI that your organization creates, receives, maintains or transmits, whether the information is internal orcloud-based. This includes e-PHI in all forms, including physical media (hard drives, CDs, DVDs, Flash memory cards, handheld devices, workstations, network infrastructure, etc)","choices":[]},{"type":"MultiChecklist","text":"Note the method(s) used to collect the above information (also attach relevant documentation in upload question below): ","choices":["Review of past or existing projects","Interview with key people","Documentation review","Data gathering techniques"]},{"type":"FileUpload","text":"Upload any information related to the above questions","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"LongAnswer","text":"Identify and document potential threats and vulnerabilities","choices":[]},{"type":"FileUpload","text":"Upload any information regarding threats and vulnerabilities","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"LongAnswer","text":"Assess current security measures (The security measures implemented to reduce risk will vary among organizations. For example, small organizations tend to have more control within their environment. Small organizations tend to have fewer variables (i.e. fewer workforce members and information systems) to consider when making decisions regarding how to safeguard ePHI. As a result, the appropriate security measures that reduce the likelihood of risk to the confidentiality, availability and integrity of e-PHI in a small organization may differ from those that are appropriate in large organizations.)","choices":[]},{"type":"FileUpload","text":"Upload security measures documentation","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"LongAnswer","text":"Determine the liklihood of threat occurance (The Security Rule requires organizations to take into account the probability of potential risks to e-PHI. The results of this assessment, combined with the initial list of threats, will influence the determination of which threats the Rule requires protection against because they are “reasonably anticipated.” The output of this part should be documentation of all threat and vulnerability combinations with associated likelihood estimates that may impact the confidentiality, availability and integrity of e-PHI of an organization.)","choices":[]},{"type":"FileUpload","text":"Upload likelihood documentation","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"LongAnswer","text":"Determine the Potential Impact of Threat Occurrence (The Rule also requires consideration of the “criticality,” or impact, of potential risks to confidentiality, integrity, and availability of e-PHI. An organization must assess the magnitude of the potential impact resulting from a threat triggering or exploiting a specific vulnerability. An entity may use either a qualitative or quantitative method or a combination of the two methods to measure the impact on the organization. The output of this process should be documentation of all potential impacts associated with the occurrence of threats triggering or exploiting vulnerabilities that affect the confidentiality, availability and integrity of e-PHI within an organization.)","choices":[]},{"type":"FileUpload","text":"Upload potential impact documentation","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"LongAnswer","text":"Determine the Level of Risk (Organizations should assign risk levels for all threat and vulnerability combinations identified during the risk analysis. The level of risk could be determined, for example, by analyzing the values assigned to the likelihood of threat occurrence and resulting impact of threat occurrence. The risk level determination might be performed by assigning a risk level based on the average of the assigned likelihood and impact levels. The output should be documentation of the assigned risk levels and a list of corrective actions to be performed to mitigate each risk level.) ","choices":[]},{"type":"FileUpload","text":"Upload Level of Risk documentation ","choices":[]}]}