{"name":"HIPAA: NIST 800-66: 4.17: Person or Entity Authentication","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Determine Authentication Applicability to Current Systems/Applications","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify methods available for authentication. Under the HIPAA Security Rule, authentication is the corroboration that a person is the one claimed. (45 CFR &sect; 164.304).</li>\n<li>Authentication requires establishing the validity of a transmission source and/or verifying an individual&rsquo;s claim that he or she has been authorized for specific access privileges to information and information systems.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What authentication methods are available?","choices":[]},{"type":"LongAnswer","text":"What are the advantages and disadvantages of each method?","choices":[]},{"type":"LongAnswer","text":"What will it cost to implement the available methods in our environment?","choices":[]},{"type":"LongAnswer","text":"Do we have trained staff who can maintain the system or do we need to consider outsourcing some of the support?","choices":[]},{"type":"YesNo","text":"Are passwords being used?","choices":[]},{"type":"YesNo","text":"If so, are they unique by individual?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Evaluate Authentication Options Available","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Weigh the relative advantages and disadvantages of commonly used authentication approaches.</li>\n<li>There are four commonly used authentication approaches available:\n<ul>\n<li>Something a person knows, such as a password,</li>\n<li>Something a person has or is in possession of, such as a token (smart card, ATM card, etc.),</li>\n<li>Some type of biometric identification a person provides, such as a fingerprint, or</li>\n<li>A combination of two or more of the above approaches.</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What are the strengths and weaknesses of each available option?","choices":[]},{"type":"LongAnswer","text":"Which can be best supported with assigned resources (budget/staffing)?","choices":[]},{"type":"LongAnswer","text":"What level of authentication is appropriate based on our assessment of risk to the information/systems?","choices":[]},{"type":"YesNo","text":"Do we need to acquire outside vendor support to implement the process?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Select and Implement Authentication Option","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Consider the results of the analysis conducted under Key Activity 2, above, and select appropriate authentication methods.</li>\n<li>Implement the methods selected into your operations and activities.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Has necessary user and support staff training been completed?","choices":[]},{"type":"YesNo","text":"Have formal authentication policy and procedures been established and communicated?","choices":[]},{"type":"YesNo","text":"Has necessary testing been completed to ensure that the authentication system is working as prescribed?","choices":[]},{"type":"YesNo","text":"Do the procedures include ongoing system maintenance and updates?","choices":[]},{"type":"YesNo","text":"Is the process implemented in such a way that it does not compromise the authentication information (password file encryption, etc.)?","choices":[]}]}