{"name":"HIPAA: NIST 800-66: 4.13: Device and Media Controls","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Implement Methods for Final Disposal of EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement policies and procedures to address the final disposition of EPHI and/or the hardware or electronic media on which it is stored.</li>\n<li>Determine and document the appropriate methods to dispose of hardware, software, and the data itself.</li>\n<li>Assure that EPHI is properly destroyed and cannot be recreated.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What data is maintained by the organization, and where?","choices":[]},{"type":"LongAnswer","text":"Is data on removable, reusable media such as tapes and CDs?","choices":[]},{"type":"YesNo","text":"Is there a process for destroying data on hard drives and file servers?","choices":[]},{"type":"LongAnswer","text":"What are the options for disposing of data on hardware? What are the costs?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Develop and Implement Procedures for Reuse of Electronic Media","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement procedures for removal of EPHI from electronic media before the media are made available for reuse.</li>\n<li>Ensure that EPHI previously stored on electronic media cannot be accessed and reused.</li>\n<li>Identify removable media and their use.</li>\n<li>Ensure that EPHI is removed from reusable media before they are used to record new information.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Do policies and procedures already exist regarding reuse of electronic media (hardware and software)?","choices":[]},{"type":"LongAnswer","text":"Is one individual and/or department responsible for coordinating the disposal of data and the reuse of the hardware and software?","choices":[]},{"type":"YesNo","text":"Are employees appropriately trained on security and risks to EPHI when reusing software and hardware?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Maintain Accountability for Hardware and Electronic Media","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Maintain a record of the movements of hardware and electronic media and any person responsible therefore.</li>\n<li>Ensure that EPHI is not inadvertently released or shared with any unauthorized party.</li>\n<li>Ensure that an individual is responsible for, and records the receipt and removal of, hardware and software with EPHI.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Where is data stored (what type of media)?","choices":[]},{"type":"LongAnswer","text":"What procedures already exist regarding tracking of hardware and software within the company?","choices":[]},{"type":"LongAnswer","text":"If workforce members are allowed to remove electronic media that contain or may be used to access EPHI, do procedures exist to track the media externally?","choices":[]},{"type":"LongAnswer","text":"Who is responsible for maintaining records of hardware and software?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Develop Data Backup and Storage Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Create a retrievable exact copy of EPHI, when needed, before movement of equipment.</li>\n<li>Ensure that an exact retrievable copy of the data is retained and protected to protect the integrity of EPHI during equipment relocation.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Are backup files maintained offsite to assure data availability in the event data is lost while transporting or moving electronic media containing EPHI?","choices":[]},{"type":"LongAnswer","text":"If data were to be unavailable while media are transported or moved for a period of time, what would the business impact be?","choices":[]}]}