{"name":"HIPAA: Compliance Overview","instructions":"<p>HIPAA compliance is a complex endeavor where lots can go wrong.&nbsp; Use this checklist as an introduction to the things you'll need to do to get and stay compliant.&nbsp;&nbsp;</p>\n<p>&nbsp; &nbsp; &nbsp;from:&nbsp; <a href=\"https://www.hipaamate.com/hipaa-compliance-checklist.html?utm_term=hipaa%20compliance%20checklist&amp;utm_campaign=&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=4388253274&amp;hsa_cam=10094668028&amp;hsa_grp=104293185267&amp;hsa_ad=436269886516&amp;hsa_src=g&amp;hsa_tgt=kwd-298753915418&amp;hsa_kw=hipaa%20compliance%20checklist&amp;hsa_mt=p&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gclid=CjwKCAjwqpP2BRBTEiwAfpiD-4RuOm8XrBtE9D6aRorB6t5oH1aFEh2QWlb6ih0XDWAIim2Qa3mJIxoCLLMQAvD_BwE\" target=\"_blank\" rel=\"noopener\">https://www.hipaamate.com/hipaa-compliance-checklist.html</a></p>","items":[{"type":"Task","text":"Privacy Officer: No expert needed; however, this person should have access to an expert or be technology savvy and well versed in HIPAA requirements themselves.","choices":[]},{"type":"Task","text":"Job Roles: Document the level of information access each job role requires to complete assigned job activities.","choices":[]},{"type":"Task","text":"Maintenance Logbook: A history of physical changes, upgrades, repairs, and other modifications to your facility where ePHI is kept.","choices":[]},{"type":"Task","text":"Workforce List: Know each person's level of ePHI access, mobile device usage, remote access authorization, inventory assignment, signed agreements, and training history.","choices":[]},{"type":"Task","text":"ePHI Inventory: List every device (computer, smart phone, printer, etc.) in which patient information is stored or passes through. Know what safeguards are in place to protect each inventory item.","choices":[]},{"type":"Task","text":"Business Associates: Keep a list of, and obtain signed Business Associate Agreements from, those who perform a service on your behalf involving the use of protected health information.","choices":[]},{"type":"Task","text":"Policies & Procedures:  A collection of independent policies & procedures, some of which must be custom to your office (can't be one-size-fits-all). Your policies must be reviewed and approved annually.","choices":[]},{"type":"Task","text":"Annual Staff Training: Generic online videos don't count because HIPAA training must be specific to your office's polices. Training topics include: breach notification, sanction policies, password management, malware basics, workstation use, and emergency operations.","choices":[]},{"type":"Task","text":"Activity Review (ISAR): Review records of information system activity, such as audit logs, to ensure patient records are being accessed in a manner consistent with your policies and procedures.","choices":[]},{"type":"Task","text":"Risk Analysis: List reasonably anticipated threat-vulnerability combinations and assign risk scores based on likelihood and impact determinations. Warning: A \"risk assessment\" is not a risk analysis.","choices":[]},{"type":"Task","text":"Risk Management Plan: Implement new security measures (a.k.a. safeguards) to reduce risk to reasonable and appropriate levels. \"Mitigation plan\" is another term often used to describe this HIPAA requirement.","choices":[]},{"type":"Task","text":"Compliance Reports: Reports help prove you took reasonable steps to protect patient information. After all, \"if it wasn't documented, it didn't happen.\"","choices":[]}]}