{"name":"HIPAA: NIST 800-66: 4.14: Access Control","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Analyze Workloads and Operations To Identify the Access Needs of All Users","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify an approach for access control.</li>\n<li>Consider all applications and systems containing EPHI that should be available only to authorized users.</li>\n<li>Integrate these activities into the access granting and management process.78</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have all applications/systems with EPHI been identified?","choices":[]},{"type":"LongAnswer","text":"What user roles are defined for those applications/systems?","choices":[]},{"type":"LongAnswer","text":"Where is the EPHI supporting those applications/systems currently housed (e.g., stand-alone PC, network)?","choices":[]},{"type":"YesNo","text":"Are data and/or systems being accessed remotely?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Identify Technical Access Control Capabilities","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Determine the access control capability of all information systems with EPHI.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"How are the systems accessed (viewing data, modifying data, creating data)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Ensure that All System Users Have Been Assigned a Unique Identifier","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Assign a unique name and/or number for identifying and tracking user identity.</li>\n<li>Ensure that system activity can be traced to a specific user.</li>\n<li>Ensure that the necessary data is available in the system logs to support audit and other related business functions.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"How should the identifier be established (length and content)?","choices":[]},{"type":"LongAnswer","text":"Should the identifier be self-selected or randomly generated?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Develop Access Control Policy","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish a formal policy for access control that will guide the development of procedures.</li>\n<li>Specify requirements for access control that are both feasible and cost-effective for implementation.82</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have rules of behavior been established and communicated to system users?","choices":[]},{"type":"LongAnswer","text":"How will rules of behavior be enforced?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Implement Access Control Procedures Using Selected Hardware and Software","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement the policy and procedures using existing or additional hardware/software solution(s).</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Who will manage the access controls procedures?","choices":[]},{"type":"YesNo","text":"Are current users trained in access control management?","choices":[]},{"type":"YesNo","text":"Will user training be needed to implement access control procedures?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Review and Update User Access","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Enforce policy and procedures as a matter of ongoing operations.</li>\n<li>Determine if any changes are needed for access control mechanisms.</li>\n<li>Establish procedures for updating access when users require the following:\n<ul>\n<li>Initial access</li>\n<li>Increased access</li>\n<li>Access to different systems or applications than those they currently have</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have new employees/users been given proper instructions for protecting data and systems?","choices":[]},{"type":"LongAnswer","text":"What are the procedures for new employee/user access to data and systems?","choices":[]},{"type":"LongAnswer","text":"Are there procedures for reviewing and, if appropriate, modifying access authorizations for existing users?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"7) Establish an Emergency Access Procedure","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish (and implement as needed) procedures for obtaining necessary electronic protected health information during an emergency.</li>\n<li>Identify a method of supporting continuity of operations should the normal access procedures be disabled or unavailable due to system problems.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"When should the emergency access procedure be activated?","choices":[]},{"type":"ShortAnswer","text":"Who is authorized to make the decision?","choices":[]},{"type":"ShortAnswer","text":"Who has assigned roles in the process?","choices":[]},{"type":"LongAnswer","text":"Will systems automatically default to settings and functionalities that will enable the emergency access procedure or will the mode be activated by the system administrator or other authorized individual?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"8) Automatic Logoff and Encryption and Decryption","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Consider whether the addressable implementation specifications of this standard are reasonable and appropriate:\n<ul>\n<li>Implement electronic procedures that terminate an electronic session after a predetermined time of inactivity.</li>\n<li>Implement a mechanism to encrypt and decrypt EPHI.</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are automatic logoff features available for any of the covered entity’s operating systems or other major applications?","choices":[]},{"type":"YesNo","text":"If applications have been created or developed in-house, is it reasonable and appropriate to modify them to feature automatic logoff capability?","choices":[]},{"type":"ShortAnswer","text":"What period of inactivity prior to automatic logoff is reasonable and appropriate for the covered entity?","choices":[]},{"type":"LongAnswer","text":"What encryption systems are available for the covered entity’s EPHI?","choices":[]},{"type":"YesNo","text":"Is encryption appropriate for storing and maintaining EPHI (“at rest”), as well as while it is transmitted?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"9) Terminate Access if it is No Longer Required","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Ensure that access to EPHI is terminated if the access is no longer authorized.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are rules being enforced to remove access by staff members who no longer have a need to know because they have changed assignments or have stopped working for the organization?","choices":[]}]}