{"name":"HIPAA: NIST 800-66: 4.16: Integrity","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Identify All Users Who Have Been Authorized to Access EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify all approved users with the ability to alter or destroy data, if reasonable and appropriate.</li>\n<li>Address this Key Activity in conjunction with the identification of unauthorized sources in Key Activity 2, below.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"How are users authorized to access the information?","choices":[]},{"type":"YesNo","text":"Is there a sound basis established as to why they need the access?","choices":[]},{"type":"YesNo","text":"Have they been trained on how to use the information?","choices":[]},{"type":"YesNo","text":"Is there an audit trail established for all accesses to the information?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Identify Any Possible Unauthorized Sources that May Be Able to Intercept the Information and Modify It","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify scenarios that may result in modification to the EPHI by unauthorized sources (e.g., hackers, disgruntled employees, business competitors).</li>\n<li>Conduct this activity as part of your risk analysis.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What are likely sources that could jeopardize information integrity?","choices":[]},{"type":"LongAnswer","text":"What can be done to protect the integrity of the information when it is residing in a system (at rest)?","choices":[]},{"type":"LongAnswer","text":"What procedures and policies can be established to decrease or eliminate alteration of the information during transmission (e.g., encryption)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Develop the Integrity Policy and Requirements","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish a formal (written) set of integrity requirements based on the results of the analysis completed in the previous steps.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have the requirements been discussed and agreed to by identified key personnel involved in the processes that are affected?","choices":[]},{"type":"YesNo","text":"Have the requirements been documented?","choices":[]},{"type":"YesNo","text":"Has a written policy been developed and communicated to system users?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Implement Procedures to Address These Requirements","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify and implement methods that will be used to protect the information from modification.</li>\n<li>Identify and implement tools and techniques to be developed or procured that support the assurance of integrity.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are current audit, logging, and access control techniques sufficient to address the integrity of the information?","choices":[]},{"type":"LongAnswer","text":"If not, what additional techniques can we apply to check information integrity (e.g., quality control process, transaction and output reconstruction)?","choices":[]},{"type":"YesNo","text":"Can additional training of users decrease instances attributable to human errors?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Implement a Mechanism to Authenticate EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement electronic mechanisms to corroborate that EPHI has not been altered or destroyed in an unauthorized manner.</li>\n<li>Consider possible electronic mechanisms for authentication such as:\n<ul>\n<li>Error-correcting memory</li>\n<li>Magnetic disk storage</li>\n<li>Digital signatures</li>\n<li>Check sum technology.</li>\n</ul>\n</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are the uses of both electronic and nonelectronic mechanisms necessary for the protection of EPHI?","choices":[]},{"type":"YesNo","text":"Are appropriate electronic authentication tools available?","choices":[]},{"type":"YesNo","text":"Are available electronic authentication tools interoperable with other applications and system components?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Establish a Monitoring Process To Assess How the Implemented Process Is Working","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Review existing processes to determine if objectives are being addressed.</li>\n<li>Reassess integrity processes continually as technology and operational environments change to determine if they need to be revised.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Are there reported instances of information integrity problems and have they decreased since integrity procedures have been implemented?","choices":[]},{"type":"LongAnswer","text":"Does the process, as implemented, provide a higher level of assurance that information integrity is being maintained?","choices":[]}]}