{"name":"HIPAA: NIST 800-66: 4.1: Administrative Safeguards","items":[{"type":"Heading","text":"1) Identify relevant information systems","choices":[]},{"type":"LongAnswer","text":"Identify all information systems that house e-PHI.  (Include all hardware and software that are used to collect, store, process or transmit e-PHI.)","choices":[]},{"type":"LongAnswer","text":"Analyze business functions and verify ownership and control of information system elements as necessary.","choices":[]},{"type":"FileUpload","text":"Upload relevant documents","choices":[]},{"type":"YesNo","text":"Are all hardware and software for which the organization is responsible periodically inventoried?","choices":[]},{"type":"YesNo","text":"Have hardware and software that maintains or transmits EPHI been identified?","choices":[]},{"type":"YesNo","text":"Does this inventory include removable media and remote access devices?","choices":[]},{"type":"YesNo","text":"Is the current information system configuration documented, including connections to other systems?","choices":[]},{"type":"YesNo","text":"Have the types of information and uses of that information been identified and the sensitivity of each type of information been evaluated? ","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Conduct Risk Assessment","choices":[]},{"type":"LongAnswer","text":"Conduct an accurate and thorough assessment of the potential risks and vulnerabilities to the confidentiality, integrity, and availability of EPHI held by the covered entity.","choices":[]},{"type":"FileUpload","text":"Risk Assessment documents","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"ShortAnswer","text":"Are there any prior risk assessments, audit comments, security requirements, and/or security test results? What were the results?","choices":[]},{"type":"LongAnswer","text":"Is there intelligence available from agencies, the Office of the Inspector General (OIG), the US-CERT, virus alerts, and/or vendors?  What are they?","choices":[]},{"type":"LongAnswer","text":"What are the current and planned controls?","choices":[]},{"type":"ShortAnswer","text":"Is the facility located in a region prone to any natural disasters, such as earthquakes, floods, or fires? Describe.","choices":[]},{"type":"ShortAnswer","text":"Has responsibility been assigned to check all hardware and software, including hardware and software used for remote access, to determine whether selected security settings are enabled?  If yes, to whom?","choices":[]},{"type":"ShortAnswer","text":"Is there an analysis of current safeguards and their effectiveness relative to the identified risks? Describe","choices":[]},{"type":"ShortAnswer","text":"Have all processes involving EPHI been considered, including creating, receiving, maintaining, and transmitting it?  Please explain.","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Implement a Risk Management Program","choices":[]},{"type":"Paragraph","text":"<p>Implement security measures sufficient to reduce risks and vulnerabilities to a reasonable and appropriate level to comply with &sect;164.306(a).</p>","choices":[]},{"type":"ShortAnswer","text":"Do current safeguards ensure the confidentiality, integrity, and availability of all EPHI? Explain","choices":[]},{"type":"ShortAnswer","text":"Do current safeguards protect against reasonably anticipated uses or disclosures of EPHI that are not permitted by the Privacy Rule? Explain","choices":[]},{"type":"ShortAnswer","text":"Has the covered entity protected against all reasonably anticipated threats or hazards to the security and integrity of EPHI? Explain","choices":[]},{"type":"ShortAnswer","text":"Has the covered entity assured compliance with all policies and procedures by its workforce? Explain","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Acquire IT Systems and Services","choices":[]},{"type":"Paragraph","text":"<p>Although the HIPAA Security Rule does not require purchasing any particular technology, additional hardware, software, or services may be needed to adequately protect information. Considerations for their selection should include the following:</p>\n<ul>\n<li>Applicability of the IT solution to the intended environment;</li>\n<li>The sensitivity of the data;</li>\n<li>The organization&rsquo;s security policies, procedures, and standards; and</li>\n<li>Other requirements such as resources available for operation, maintenance, and training.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"List IT services and/or products that need to be acquired.","choices":[]},{"type":"ShortAnswer","text":"Will new security controls work with the existing IT architecture?  Explain.","choices":[]},{"type":"ShortAnswer","text":"Have the security requirements of the organization been compared with the security features of existing or proposed hardware and software?  Explain","choices":[]},{"type":"ShortAnswer","text":"Has a cost-benefit analysis been conducted to determine the reasonableness of the investment given the security risks identified? Explain","choices":[]},{"type":"ShortAnswer","text":"Has a training strategy been developed? Describe.","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Create and Deploy Policies and Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement the decisions concerning the management, operational, and technical controls selected to mitigate identified risks.</li>\n<li>Create policies that clearly establish roles and responsibilities and assign ultimate responsibility for the implementation of each control to particular individuals or offices.</li>\n<li>Create procedures to be followed to accomplish particular security-related tasks.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Are policies and procedures in place for security? Describe.","choices":[]},{"type":"YesNo","text":"Is there a formal (documented) system security plan?","choices":[]},{"type":"YesNo","text":" Is there a formal contingency plan?","choices":[]},{"type":"YesNo","text":"Is there a process for communicating policies and procedures to the affected employees?","choices":[]},{"type":"YesNo","text":"Are policies and procedures reviewed and updated as needed?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Develop and Implement a Sanction Policy","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Apply appropriate sanctions against workforce members who fail to comply with the security policies and procedures of the covered entity.</li>\n<li>Develop policies and procedures for imposing appropriate sanctions (e.g., reprimand, termination) for noncompliance with the organization&rsquo;s security policies.</li>\n<li>Implement sanction policy as cases arise.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"Is there a formal process in place to address system misuse, abuse, and fraudulent activity? Describe.","choices":[]},{"type":"YesNo","text":"Is there a formal process in place to address system misuse, abuse, and fraudulent activity?","choices":[]},{"type":"ShortAnswer","text":"Has the need and appropriateness of a tiered structure of sanctions that accounts for the magnitude of harm and possible types of inappropriate disclosures been considered? Elaborate..","choices":[]},{"type":"ShortAnswer","text":"How will managers and employees be notified regarding suspect activity?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"7) Develop and Deploy the Information System Activity Review Process","choices":[]},{"type":"Paragraph","text":"<p>Implement procedures to regularly review records of information system activity, such as audit logs, access reports, and security incident tracking reports.</p>","choices":[]},{"type":"ShortAnswer","text":"Who is responsible for the overall process and results?","choices":[]},{"type":"ShortAnswer","text":"How often will reviews take place?","choices":[]},{"type":"ShortAnswer","text":"How often will review results be analyzed?","choices":[]},{"type":"ShortAnswer","text":"What is the organization’s sanction policy for employee violations?","choices":[]},{"type":"ShortAnswer","text":"Where will audit information reside (e.g., separate server)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"8) Develop Appropriate Standard Operating Procedures","choices":[]},{"type":"Paragraph","text":"<p>Determine the types of audit trail data and monitoring procedures that will be needed to derive exception reports.</p>","choices":[]},{"type":"ShortAnswer","text":"How will exception reports or logs be reviewed?","choices":[]},{"type":"ShortAnswer","text":"Where will monitoring reports be filed and maintained?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"9) Implement the Information System Activity Review and Audit Process21","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Activate the necessary review process.</li>\n<li>Begin auditing and logging activity.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"What mechanisms will be implemented to assess the effectiveness of the review process (measures)?","choices":[]},{"type":"ShortAnswer","text":"What is the plan to revise the review process when needed?","choices":[]}]}