{"name":"HIPAA: NIST 800-66: 4.18: Transmission Security","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Identify Any Possible Unauthorized Sources that May Be Able to Intercept and/or Modify the Information","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Identify scenarios that may result in modification of the EPHI by unauthorized sources during transmission (e.g., hackers, disgruntled employees, business competitors).</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What measures exist to protect EPHI in transmission?","choices":[]},{"type":"YesNo","text":"Is there an auditing process in place to verify that EPHI has been protected against unauthorized access during transmission?","choices":[]},{"type":"YesNo","text":"Are there trained staff members to monitor transmissions?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Develop and Implement Transmission Security Policy and Procedures","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Establish a formal (written) set of requirements for transmitting EPHI.</li>\n<li>Identify methods of transmission that will be used to safeguard EPHI.</li>\n<li>Identify tools and techniques that will be used to support the transmission security policy.</li>\n<li>Implement procedures for transmitting EPHI using hardware and/or software, if needed.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have the requirements been discussed and agreed to by identified key personnel involved in transmitting EPHI?","choices":[]},{"type":"YesNo","text":"Has a written policy been developed and communicated to system users?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Implement Integrity Controls","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement security measures to ensure that electronically transmitted EPHI is not improperly modified without detection until disposed of.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What measures are planned to protect EPHI in transmission?","choices":[]},{"type":"YesNo","text":"Is there assurance that information is not altered during transmission?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Implement Encryption","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement a mechanism to encrypt EPHI whenever deemed appropriate.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is encryption reasonable and appropriate for EPHI in transmission?","choices":[]},{"type":"YesNo","text":"Is encryption needed to effectively protect the information?","choices":[]},{"type":"YesNo","text":"Is encryption feasible and cost-effective in this environment?","choices":[]},{"type":"LongAnswer","text":"What encryption algorithms and mechanisms are available?","choices":[]},{"type":"YesNo","text":"Does the covered entity have the appropriate staff to maintain a process for encrypting EPHI during transmission?","choices":[]},{"type":"YesNo","text":"Are staff members skilled in the use of encryption?","choices":[]}]}