{"name":"HIPAA: NIST 800-66: 4.20: Requirements for Group Health Plans","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Amend Plan Documents of Group Health Plan to Address Plan Sponsor’s Security of EPHI","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Amend plan documents to incorporate provisions to require the plan sponsor (e.g., an entity that sponsors a health plan) to implement administrative, technical, and physical safeguards that will reasonably and appropriately protect the confidentiality, integrity, and availability of EPHI that it creates, receives, maintains, or transmits on behalf of the group health plan.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Does the plan sponsor fall under the exception described in the standard?","choices":[]},{"type":"YesNo","text":"Do the plan documents require the plan sponsor to reasonably and appropriately safeguard EPHI?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Amend Plan Documents of Group Health Plan to Address Adequate Separation","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Amend plan documents to ensure that the adequate separation between the group health plan and plan sponsor required by &sect;164.504(f)(2)(iii) is supported by reasonable and appropriate security measures.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do plan documents address the obligation to keep EPHI secure with respect to the plan sponsor’s employees, classes of employees, or other persons who will be given access to EPHI?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Amend Plan Documents of Group Health Plan to Address Security of EPHI Supplied to Plan Sponsors’ Agents and Subcontractors","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Amend plan documents to incorporate provisions to require the plan sponsor to ensure that any agent, including a subcontractor, to whom it provides EPHI agrees to implement reasonable and appropriate security measures to protect the EPHI.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do the plan documents of the group health plan address the issue of subcontractors and other agents of the plan sponsor implementing reasonable and appropriate security measures?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Amend Plan Documents of Group Health Plans to Address Reporting of Security Incidents","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Amend plan documents to incorporate provisions to require the plan sponsor to report to the group health plan any security incident of which it becomes aware.</li>\n<li>Establish specific policy for security incident reporting.</li>\n<li>Establish a reporting mechanism and a process for the plan sponsor to use in the event of a security incident.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there a procedure in place for security incident reporting?","choices":[]},{"type":"YesNo","text":"Are procedures in place for responding to security incidents?","choices":[]}]}