{"name":"HIPAA: NIST 800-66: 4.4: Information Access Management","instructions":"<p></p>","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Isolate Healthcare Clearinghouse Functions","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>If a healthcare clearinghouse is part of a larger organization, the clearinghouse must implement policies and procedures that protect the EPHI of the clearinghouse from unauthorized access by the larger organization.</li>\n<li>Determine if a component of the covered entity constitutes a healthcare clearinghouse under the HIPAA Security Rule.</li>\n<li>If no clearinghouse functions exist, document this finding. If a clearinghouse exists within the organization, implement procedures for access consistent with the HIPAA Privacy Rule.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Does the healthcare clearinghouse share hardware or software with a larger organization of which it is a part?","choices":[]},{"type":"YesNo","text":"Does the healthcare clearinghouse share staff or physical space with staff from a larger organization?","choices":[]},{"type":"YesNo","text":"Has a separate network or subsystem been established for the healthcare clearinghouse, if reasonable and appropriate?","choices":[]},{"type":"YesNo","text":"Has staff of the healthcare clearinghouse been trained to safeguard EPHI from disclosure to the larger organization, if required for compliance with the HIPAA Privacy Rule?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Implement Policies and Procedures for Authorizing Access","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement policies and procedures for granting access to EPHI, for example, through access to a workstation, transaction, program, process, or other mechanism.</li>\n<li>Decide how access will be granted to workforce members within the organization.</li>\n<li>Select the basis for restricting access.</li>\n<li>Select an access control method (e.g., identity-based, role-based, or other reasonable and appropriate means of access.)</li>\n<li>Determine if direct access to EPHI will ever be appropriate for individuals external to the organization (e.g., business partners or patients seeking access to their own EPHI).&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do the organization’s IT systems have the capacity to set access controls?","choices":[]},{"type":"YesNo","text":"Are there documented job descriptions that accurately reflect assigned duties and responsibilities and enforce segregation of duties?","choices":[]},{"type":"YesNo","text":"Does the organization grant remote access to EPHI?","choices":[]},{"type":"YesNo","text":"What method(s) of access control is (are) used (e.g., identity-based, role-based, location-based, or a combination)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Implement Policies and Procedures for Access Establishment and Modification","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement policies and procedures that, based upon the entity's access authorization policies, establish, document, review, and modify a user's right of access to a workstation, transaction, program, or process.</li>\n<li>Establish standards for granting access.</li>\n<li>Provide formal authorization from the appropriate authority before granting access to sensitive information.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are duties separated such that only the minimum necessary EPHI is made available to each staff member based on their job requirements?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Evaluate Existing Security Measures Related to Access","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Evaluate the security features of access controls already in place, or those of any planned for implementation, as<br />appropriate.</li>\n<li>Determine if these security features involve alignment with other existing management, operational, and technical controls, such as policy standards and personnel procedures, maintenance and review of audit trails, identification and authentication of users, and physical access controls.&nbsp;</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Are there policies and procedures related to the security of access controls? If so, are they updated regularly?","choices":[]},{"type":"YesNo","text":"Are authentication mechanisms used to verify the identity of those accessing systems protected from inappropriate manipulation?","choices":[]},{"type":"YesNo","text":"Does management regularly review the list of access authorizations, including remote access authorizations, to verify that the list is accurate and has not been inappropriately altered?","choices":[]}]}