{"name":"HIPAA: NIST 800-66: 4.5: Security Awareness and Training","items":[{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"1) Conduct a Training Needs Assessment","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Determine the training needs of the organization.</li>\n<li>Interview and involve key personnel in assessing security training needs.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"What awareness, training, and education programs are needed? Which are required?","choices":[]},{"type":"LongAnswer","text":"What is the current status regarding how these needs are being addressed (e.g., how well are current efforts working)?","choices":[]},{"type":"LongAnswer","text":"Where are the gaps between the needs and what is being done (e.g., what more needs to be done)?","choices":[]},{"type":"LongAnswer","text":"What are the training priorities in terms of content and audience?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"2) Develop and Approve a Training Strategy and a Plan","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Address the specific HIPAA policies that require security awareness and training in the security awareness and training program.</li>\n<li>Outline in the security awareness and training program the scope of the awareness and training program; the goals; the target audiences; the learning objectives; the deployment methods, evaluation, and measurement techniques; and the frequency of training.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Is there a procedure in place to ensure that everyone in the organization receives security awareness training?","choices":[]},{"type":"LongAnswer","text":"What type of security training is needed to address specific technical topics based on job responsibility?","choices":[]},{"type":"ShortAnswer","text":"When should training be scheduled to ensure that compliance deadlines are met?","choices":[]},{"type":"YesNo","text":"Has the organization considered the training needs of non-employees (e.g., contractors, interns)?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"3) Protection from Malicious Software; Log-in Monitoring; and Password Management","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>As reasonable and appropriate, train employees regarding procedures for:\n<ul>\n<li>Guarding against, detecting, and reporting malicious software;</li>\n<li>Monitoring log-in attempts and reporting discrepancies; and</li>\n<li>Creating changing, and safeguarding passwords.</li>\n</ul>\n</li>\n<li>Incorporate information concerning staff members&rsquo; roles and responsibilities in implementing these implementation specifications into training and awareness efforts.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Do employees know the importance of timely application of system patches to protect against malicious software and exploitation of vulnerabilities?","choices":[]},{"type":"YesNo","text":"Are employees aware that log-in attempts may be monitored?","choices":[]},{"type":"YesNo","text":"Do employees that monitor log-in attempts know to whom to report discrepancies?","choices":[]},{"type":"YesNo","text":"Do employees understand their roles and responsibilities in selecting a password of appropriate strength, changing the password periodically (if required), and safeguarding their password?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"4) Develop Appropriate Awareness and Training Content, Materials, and Methods","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Select topics that may need to be included in the training materials.</li>\n<li>Incorporate new information from email advisories, online IT security daily news Web sites, and periodicals, as is reasonable and appropriate.</li>\n<li>Consider using a variety of media and avenues according to what is appropriate for the organization based on workforce size, location, level of education, etc.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have employees received a copy of, and do they have ready access to, the organization’s security procedures and policies?","choices":[]},{"type":"YesNo","text":"Do employees know whom to contact and how to handle a security incident?","choices":[]},{"type":"YesNo","text":"Do employees understand the consequences of noncompliance with the stated security policies?","choices":[]},{"type":"YesNo","text":"Do employees who travel know how to handle physical laptop security issues and information security issues?","choices":[]},{"type":"YesNo","text":"Has the covered entity researched available training resources?","choices":[]},{"type":"YesNo","text":"Is dedicated training staff available for delivery of security training?","choices":[]},{"type":"LongAnswer","text":"If not, who will deliver the training?","choices":[]},{"type":"ShortAnswer","text":"What is the security training budget?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"5) Implement the Training","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Schedule and conduct the training outlined in the strategy and plan.</li>\n<li>Implement any reasonable technique to disseminate the security messages in an organization, including newsletters, screensavers, videotapes, email messages, teleconferencing sessions, staff meetings, and computer-based training.</li>\n</ul>","choices":[]},{"type":"YesNo","text":"Have all employees received adequate training to fulfill their security responsibilities?","choices":[]},{"type":"YesNo","text":"Are there sanctions if employees do not complete required training?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"6) Implement Security Reminders","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Implement periodic security updates.</li>\n<li>Provide periodic security updates to staff, business associates, and contractors.</li>\n</ul>","choices":[]},{"type":"ShortAnswer","text":"What methods are available or already in use to make or keep employees aware of security, e.g., posters or booklets?","choices":[]},{"type":"ShortAnswer","text":"Is security refresher training performed on a periodic basis (e.g., annually)?","choices":[]},{"type":"YesNo","text":"Is security awareness discussed with all new hires?","choices":[]},{"type":"ShortAnswer","text":"Are security topics reinforced during routine staff meetings?","choices":[]},{"type":"SectionBreak","choices":[]},{"type":"Heading","text":"7) Monitor and Evaluate Training Plan","choices":[]},{"type":"Paragraph","text":"<ul>\n<li>Keep the security awareness and training program current.</li>\n<li>Conduct training whenever changes occur in the technology and practices as appropriate.</li>\n<li>Monitor the training program implementation to ensure that all employees participate.</li>\n<li>Implement corrective actions when problems arise.</li>\n</ul>","choices":[]},{"type":"LongAnswer","text":"Are employee training and professional development programs documented and monitored, if reasonable and appropriate?","choices":[]},{"type":"LongAnswer","text":"How are new employees trained on security?","choices":[]},{"type":"YesNo","text":"Are new non-employees (e.g., contractors, interns) trained on security?","choices":[]}]}