{
  "name": "Critical Equipment Areas",
  "items": [
    {
      "type": "Paragraph",
      "text": "Used to evaluate risks to critical equipment, telephone room, data center, etc.\n\nInstructions:\n\n1. Complete this form for each area where critical equipment is installed.\n\n2. Mitigate risks by reviewing this list while planning new construction, renovations, and relocation.",
      "choices": [
        ""
      ]
    },
    {
      "type": "LongAnswer",
      "text": "Building name and address:",
      "choices": [
        ""
      ]
    },
    {
      "type": "ShortAnswer",
      "text": "Floor Number:",
      "choices": [
        ""
      ]
    },
    {
      "type": "ShortAnswer",
      "text": "Area evaluated (department, room number, or equipment name):",
      "choices": [
        ""
      ]
    },
    {
      "type": "YesNo",
      "text": "Are there water lines, drains, or other pipes carrying liquid in the ceiling above the equipment?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "Do these lines, if any, feature fittings, valves or other connections above the equipment?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "LongAnswer",
      "text": "If pipes and fittings can not be relocated, what can be done to determine their integrity?",
      "choices": [
        ""
      ]
    },
    {
      "type": "LongAnswer",
      "text": "Describe any evidence of leakage.",
      "choices": [
        ""
      ]
    },
    {
      "type": "LongAnswer",
      "text": "Note any repairs scheduled to water systems located above the equipment.",
      "choices": [
        ""
      ]
    },
    {
      "type": "YesNo",
      "text": "On the floor directly above the equipment, are there any restrooms, sinks, fountains, or other fixtures containing water, steam or liquid?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "Are locations of shutoff valves shown on accessible floor diagrams of the floor where the equipment is located, and the floor directly above?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "Are shutoff valves marked and easily accessible?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "Does the floor directly above the equipment contain any penetrations for conduit, cable, pipe, etc?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "Dropdown",
      "text": "If yes, are open spaces sealed to prevent water penetration?",
      "choices": [
        "Yes",
        " No",
        " No but repair is scheduled",
        " Not Applicable"
      ]
    },
    {
      "type": "YesNo",
      "text": "Is a spill response kit including plastic sheeting to protect equipment readily available?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "Have all staff including operators, maintenance and cleaning staff been trained to report any type of liquid leak to the maintenance department for immediate attention?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "YesNo",
      "text": "If leakage occurs or is likely to occur, are attendees instructed to shut off power when safe to do so, and protect equipment with plastic sheets?",
      "choices": [
        "Yes",
        " No"
      ]
    },
    {
      "type": "Dropdown",
      "text": "For equipment areas in the basement, are there any water mains, sprinkler mains or liquid utility pipes entering through the walls or floor?",
      "choices": [
        "Yes",
        " No",
        " Not Applicable"
      ]
    },
    {
      "type": "Dropdown",
      "text": "Is an underground plan of utility mains immediately available showing the location of shutoff valves in the event an underground leak causes water to flow through the wall or floor opening?",
      "choices": [
        "Yes",
        " No",
        " Not Applicable"
      ]
    },
    {
      "type": "YesNo",
      "text": "For areas that are periodically unoccupied, are water sensors installed on the floor, or are humidity sensors available to provide an alarm to a constantly attended position?",
      "choices": [
        "Yes",
        " No"
      ]
    }
  ]
}